Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Combination carbon monoxide/smoke detectors installed in carbon monoxide detection systems shall be an acceptable alternative to carbon monoxide detectors, provided that they are listed in accordance with UL 268 and UL 2075.
fr_ca: Les détecteurs combinés de monoxyde de carbone et de fumée installés dans des systèmes de détection de monoxyde de carbone constituent une solution de remplacement acceptable aux détecteurs de monoxyde de carbone, à condition qu’ils soient homologués conformément aux normes UL 268 et UL 2075.

source: Combination refrigerators and freezers shall have at least 50 percent of the freezer compartment shelves, including the bottom of the freezer 54 inches (1370 mm) maximum above the floor when the shelves are installed at the maximum heights possible in the compartment.
fr_ca: Au moins 50 pour cent des tablettes du compartiment congélateur des réfrigérateurs-congélateurs combinés, y compris le fond du congélateur, doivent se trouver à une hauteur maximale de 54 po [1370 mm] au-dessus du sol lorsque les tablettes sont installées à la hauteur maximale possible dans le compartiment.

source: Combination refrigerators and freezers shall have at least 50 percent of the freezer compartment shelves, including the bottom of the freezer, 54 inches (1370 mm) maximum above the floor when the shelves are installed at the maximum heights possible in the compartment.
fr_ca: Dans les réfrigérateurs-congélateurs, au moins 50 pour cent des tablettes du compartiment congélateur, y compris le fond du congélateur, doivent se trouver à une hauteur maximale de 54 po [1370 mm] au-dessus du sol lorsque les tablettes sont installées à la hauteur maximale possible dans le compartiment.

source: Combination smoke and carbon monoxide alarms shall be listed in accordance with UL 217 and UL 2034.
fr_ca: Les détecteurs combinés de fumée et de monoxyde de carbone doivent être répertoriés conformément aux normes UL 217 et UL 2034.

source: Combination smoke and carbon monoxide alarms shall be permitted to be used in lieu of smoke alarms.
fr_ca: Les détecteurs combinés de fumée et de monoxyde de carbone peuvent être utilisés à la place des détecteurs de fumée.

source: Combination smoke and carbon monoxide detectors shall be permitted to be installed in fire alarm systems in lieu of smoke detectors, provided that they are listed in accordance with UL 268 and UL 2075.
fr_ca: Les détecteurs combinés de fumée et de monoxyde de carbone peuvent être installés dans les systèmes d'alarme incendie à la place des détecteurs de fumée, à condition qu'ils soient inscrits conformément aux normes UL 268 et UL 2075.

source: Combustible hangings shall be limited to a single main curtain, borders, legs and a single backdrop.
fr_ca: Les éléments suspendus combustibles doivent être limités à un seul rideau principal, aux frises, aux pendrillons et à un seul fond de scène.

source: Combustible insulating boards not more than 1/2 inch (12.7 mm) thick and covered with finish flooring are permitted where attached directly to a noncombustible floor assembly or to wood subflooring attached to sleepers as provided for in Section 805.1.1.
fr_ca: Les panneaux isolants combustibles d’une épaisseur maximale de 1/2 pouce (12,7 mm) recouverts d’un revêtement de sol de finition sont autorisés lorsqu’ils sont fixés directement à un assemblage de plancher incombustible ou à un sous-plancher en bois fixé à des lambourdes, comme le prévoit la section 805.1.1.

source: Combustible material
fr_ca: Matériau combustible

source: Combustible material shall not remain against the underside of hearths and hearth extensions after construction.
fr_ca: Aucun matériau combustible ne doit rester contre la face inférieure des foyers et des extensions de foyer après la construction.

source: Combustible material within 12 inches (306 mm) of the fireplace opening shall not project more than 1/8 inch (3 mm) for each 1-inch (25 mm) distance from such an opening.
fr_ca: Les matériaux combustibles situés à moins de 12 po [306 mm] de l'ouverture du foyer ne doivent pas faire saillie de plus de 1/8 po [3 mm] pour chaque 1 po [25 mm] de distance par rapport à cette ouverture.

source: Combustible materials installed on or embedded in floors of buildings of Type I or II construction shall comply with Sections 805.1.1 through 805.1.3.
fr_ca: Les matériaux combustibles installés sur les planchers ou encastrés dans les planchers des bâtiments de construction de type I ou II doivent être conformes aux sections 805.1.1 à 805.1.3.

source: Combustible materials shall be permitted to be used as finish for walls, ceilings, floors and other interior surfaces of buildings.
fr_ca: Les matériaux combustibles peuvent être utilisés comme finition pour les murs, les plafonds, les planchers et les autres surfaces intérieures des bâtiments.

source: Combustible materials used in sets and scenery shall meet the fire propagation performance criteria of Test Method 1 or Test Method 2, as appropriate, of NFPA 701, in accordance with Section 806 and the International Fire Code.
fr_ca: Les matériaux combustibles utilisés dans les décors et les ensembles doivent satisfaire aux critères de performance en matière de propagation du feu de la méthode d’essai 1 ou de la méthode d’essai 2, selon le cas, de la norme NFPA 701, conformément à la section 806 et à l’International Fire Code.

source: Combustible trim, excluding handrails and guardrails, shall not exceed 10 percent of the specific wall or ceiling area to which it is attached.
fr_ca: Les éléments de finition combustibles, à l’exclusion des mains courantes et des garde-corps, ne doivent pas représenter plus de 10 % de la superficie du mur ou du plafond auquel ils sont fixés.

source: Commercial dishwashing machines shall conform to ASSE 1004 and NSF 3.
fr_ca: Les lave-vaisselle commerciaux doivent être conformes aux normes ASSE 1004 et NSF 3.

source: Common use circulation paths within employee work areas shall be accessible routes.
fr_ca: Les voies de circulation à usage commun dans les zones de travail des employés doivent être des itinéraires accessibles.

source: Common use circulation paths, located within employee work areas that are less than 1,000 square feet (93 m2) in size and defined by permanently installed partitions, counters, casework or furnishings, shall not be required to be accessible routes.
fr_ca: Les voies de circulation à usage commun, situées dans les zones de travail des employés de moins de 1000 pi2 (93 m2) et délimitées par des cloisons, des comptoirs, des meubles de rangement ou de l'ameublement installés de façon permanente, ne sont pas tenues d'être des itinéraires accessibles.

source: Common use circulation paths, located within employee work areas, that are an integral component of equipment, shall not be required to be accessible routes.
fr_ca: Les voies de circulation à usage commun, situées dans les zones de travail des employés, qui font partie intégrante de l'équipement, ne sont pas tenues d'être des itinéraires accessibles.

source: Common use circulation paths, located within exterior employee work areas that are fully exposed to the weather, shall not be required to be accessible routes.
fr_ca: Les voies de circulation à usage commun, situées dans les zones de travail extérieures des employés qui sont entièrement exposées aux intempéries, ne sont pas tenues d'être des itinéraires accessibles.

source: Communicating doors between individual sleeping units shall not be required to comply with Section 404.2.5.
fr_ca: Les portes communicantes entre les unités de couchage individuelles ne sont pas tenues de se conformer à la section 404.2.5.

source: Communication features shall be provided at the unit primary entrance complying with Section 1106.5.
fr_ca: Des dispositifs de communication doivent être installés à l’entrée principale du logement, conformément à l’article 1106.5.

source: Communications elements and features required to be accessible by the scoping provisions adopted by the administrative authority shall comply with the applicable provisions of Chapter 7.
fr_ca: Les éléments et caractéristiques de communication qui doivent être accessibles en vertu des dispositions de portée adoptées par l'autorité administrative doivent être conformes aux dispositions applicables du chapitre 7.

source: Companion seat alignment shall not be required in tiered seating that includes dining surfaces or work surfaces.
fr_ca: L'alignement du siège d'accompagnateur n'est pas exigé dans les SIÈGES en gradins qui comprennent des surfaces de restauration ou des surfaces de travail.

source: Companion seats shall be permitted to be moveable.
fr_ca: Les sièges d'accompagnateur peuvent être mobiles.

source: Concrete or masonry walls shall be deemed to satisfy the requirements of Sections 403.2.2.1 and 403.2.2.2.
fr_ca: Les murs en béton ou en maçonnerie sont réputés satisfaire aux exigences des sections 403.2.2.1 et 403.2.2.2.

source: Concrete slab and under-floor inspections shall be made after in-slab or under-floor reinforcing steel and building service equipment, conduit, piping accessories and other ancillary equipment items are in place, but before any concrete is placed or floor sheathing installed, including the subfloor.
fr_ca: Les inspections des dalles de béton et des éléments sous plancher doivent être effectuées après la mise en place de l’acier d’armature intégré à la dalle ou situé sous le plancher, des équipements techniques du bâtiment, des conduits, des accessoires de tuyauterie et des autres équipements auxiliaires, mais avant la mise en place du béton ou l’installation du revêtement de sol, y compris le sous-plancher.

source: Congregate care facilities
fr_ca: Établissements de soins collectifs

source: Congregate living facilities (nontransient) with 16 or fewer occupants
fr_ca: IÉtablissements d’habitation collective (permanents) comptant au plus 16 occupants

source: Congregate living facilities (nontransient) with more than 16 occupants
fr_ca: Établissements d’habitation collective (permanents) de plus de 16 occupants

source: Congregate living facilities (transient) with 10 or fewer occupants
fr_ca: Établissements d’habitation collective (de courte durée) comptant au plus 10 occupants

source: Congregate living facilities (transient) with more than 10 occupants
fr_ca: Établissements d’habitation collective (de courte durée) de plus de 10 occupants

source: Consistently shaped winders at the walkline shall be allowed within the same flight of stairs as rectangular treads and shall not be required to be within 3/8 inch (9.5 mm) of the rectangular tread depth.
fr_ca: Les marches biseautées de même forme au niveau de la ligne de foulée sont autorisées dans la même volée de marches que les marches rectangulaires et ne sont pas tenues d'être à moins de 3/8 po [9,5 mm] de la profondeur des marches rectangulaires.

source: Construction documents for all buildings shall describe the exterior wall envelope in sufficient detail to determine compliance with this code.
fr_ca: Les documents de construction de tous les bâtiments doivent décrire l’enveloppe des murs extérieurs avec suffisamment de détails pour permettre de déterminer leur conformité au présent code.

source: Construction documents for fire alarm systems shall be of sufficient clarity to indicate the location, nature and extent of the work proposed and show in detail that it will conform to the provisions of this code, the International Fire Code; and relevant laws, ordinances, rules and regulations, as determined by the fire code official.
fr_ca: Les documents de construction relatifs aux systèmes d’alarme incendie doivent être suffisamment clairs pour indiquer l’emplacement, la nature et l’étendue des travaux proposés et démontrer en détail leur conformité aux dispositions du présent code, de l’International Fire Code et des lois, ordonnances, règles et règlements applicables, selon ce que détermine le responsable de la réglementation en matière d’incendie.

source: Construction documents for relocatable buildings shall comply with Section 3112.
fr_ca: Les documents de construction relatifs aux bâtiments relocalisables doivent être conformes à l’article 3112.

source: Construction documents shall be dimensioned and drawn on suitable material.
fr_ca: Les documents de construction doivent être cotés et tracés sur un support approprié.

source: Construction documents shall be in accordance with Sections 107.2.1 through 107.2.8.
fr_ca: Les documents de construction doivent être conformes aux sections 107.2.1 à 107.2.8.

source: Construction documents shall be of sufficient clarity to indicate the location, nature and extent of the work proposed and show in detail that it will conform to the provisions of this code and relevant laws, ordinances, rules and regulations, as determined by the building official.
fr_ca: Les documents de construction doivent être suffisamment clairs pour indiquer l’emplacement, la nature et l’étendue des travaux proposés et démontrer en détail que ceux-ci seront conformes aux dispositions du présent code ainsi qu’aux lois, ordonnances, règles et règlements pertinents, selon ce qu’établit le responsable de la construction.

source: Construction or work for which a permit is required shall be subject to inspection by the building official and such construction or work shall remain visible and able to be accessed for inspection purposes until approved.
fr_ca: Toute construction ou tous travaux nécessitant un permis doivent faire l’objet d’une inspection par l’autorité compétente en matière de bâtiment, et cette construction ou ces travaux doivent demeurer visibles et accessibles à des fins d’inspection jusqu’à leur approbation.

source: Consumer Product Safety Commission
fr_ca: Commission de la sécurité des produits de consommation

source: Continuous handrails at the inside turn of stairs and ramps.
fr_ca: Rampes continues au virage intérieur des escaliers et des rampes.

source: Control buttons shall be 3/4 inch (19 mm) minimum in their smallest dimension.
fr_ca: Les boutons de commande doivent avoir une dimension minimale de 3/4 po [19 mm] dans leur plus petite dimension.

source: Control buttons shall be raised or flush.
fr_ca: Les boutons de commande doivent être en relief ou affleurants.

source: Control end wall grab bars shall comply with Section 607.4.1.2.
fr_ca: Les barres d'appui du mur d'extrémité de commande doivent être conformes à la section 607.4.1.2.

source: Control panels shall be centered on a side wall.
fr_ca: Les panneaux de commande doivent être centrés sur une paroi latérale.

source: Controlled by a wall switch in accordance with Section E3903.2, Exception 1; or
fr_ca: Commandée par un interrupteur mural selon la section E3903.2, Exception 1; ou

source: Controls and hand showers shall be located according to the following:
fr_ca: Les commandes et les douchettes doivent être situées conformément à ce qui suit :

source: Controls for platform lifts shall comply with Section 309.
fr_ca: Les commandes des plates-formes élévatrices doivent être conformes à la section 309.

source: Controls mounted on ceiling fans and ceiling lights.
fr_ca: Commandes montées sur les ventilateurs de plafond et les luminaires.

source: Controls shall be on a sidewall, 12 inches (305 mm) minimum from any adjacent wall.
fr_ca: Les commandes doivent être situées sur un mur latéral, à au moins 12 po [305 mm] de tout mur adjacent.

source: Controls shall comply with Section 309.4.
fr_ca: Les commandes doivent être conformes à la section 309.4.

source: Controls, other than drain stoppers, shall be provided on an end wall, located between the bathtub rim and grab bar, and between the open side of the bathtub and the centerline of the width of the bathtub.
fr_ca: Les commandes, autres que les bouchons de vidange, doivent être prévues sur un mur d'extrémité, situées entre le rebord de la baignoire et la barre d'appui, et entre le côté dégagé de la baignoire et la ligne d'axe de la largeur de la baignoire.

source: Convents
fr_ca: Couvents

source: Conveyors and related equipment
fr_ca: Convoyeurs et équipement connexe

source: Cooking facilities provided within care recipients’ individual dwelling units are not required to comply with this Section.
fr_ca: Les installations de cuisson fournies dans les logements individuels des bénéficiaires de soins ne sont pas tenues de se conformer à cette section.

source: Cooktops and ranges shall be protected in accordance with Section 904.14.
fr_ca: Les tables de cuisson et les cuisinières doivent être protégées selon la section 904.14.

source: Cooktops and ranges shall be provided with a domestic cooking hood installed and constructed in accordance with Section 505 of the International Mechanical Code.
fr_ca: Les tables de cuisson et les cuisinières doivent être munies d'une hotte de cuisine domestique installée et construite selon la section 505 de l'International Mechanical Code.

source: Cooktops and ranges used for care-recipient training or nutritional counseling are not required to comply with Item 3 of this Section
fr_ca: Les tables de cuisson et les cuisinières utilisées pour la formation des bénéficiaires de soins ou pour la consultation en matière de nutrition ne sont pas tenues de satisfaire à l’élément 3 de la présente section

source: Cooktops shall comply with Section 1103.12.5.4.
fr_ca: Les tables de cuisson doivent être conformes à la section 1103.12.5.4.

source: Cooktops shall comply with Section 1104.12.2.3.
fr_ca: Les tables de cuisson doivent être conformes à la section 1104.12.2.3.

source: Cooktops shall comply with Section 804.5.4.
fr_ca: Les tables de cuisson doivent être conformes à la section 804.5.4.

source: Cooktops, ranges and ovens shall not be installed or used in sleeping rooms.
fr_ca: Les tables de cuisson, les cuisinières et les fours ne peuvent pas être installés ou utilisés dans les chambres à coucher.

source: Corridors contained within a dwelling unit or sleeping unit in a Group R occupancy shall have a ceiling height of not less than 7 feet (2134 mm) above the finished floor.
fr_ca: La hauteur de plafond dans les corridors contenus dans un logement ou une unité de couchage dans un usage groupe R ne doit pas être inférieure à 7 pi (2134 mm) au-dessus du sol fini.

source: Countertops and cabinetry shall be permitted at one end of the clearance, provided the following criteria are met:
fr_ca: Les comptoirs et les armoires sont autorisés à une extrémité de l'espace libre, à condition que les critères suivants soient respectés :

source: Cross aisles located more than 30 inches (762 mm) above the floor or grade below shall have guards in accordance with Section 1015.
fr_ca: Les allées transversales situées à plus de 30 po (762 mm) au-dessus du plancher ou du sol situé en contrebas doivent être munies de garde-corps conformément à la section 1015.

source: Cross slope of ramp runs shall not be steeper than 1:48.
fr_ca: La pente transversale des rampes ne doit pas être supérieure à 1:48.

source: Curbs shall be provided as required for skylights in Section 2610.2.
fr_ca: Des bordures doivent être prévues selon les exigences pour les puits de lumière de la section 2610.2.

source: DOOR LOCATION FOR LIMITED USE/LIMITED APPLICATION (LULA) ELEVATORS - CAR WITH DOORS ON ADJACENT SIDES
fr_ca: EMPLACEMENT DES PORTES POUR LES ASCENSEURS À USAGE LIMITÉ/APPLICATION LIMITÉE (LULA) - CABINE AVEC PORTES SUR LES CÔTÉS ADJACENTS

source: DOOR LOCATION FOR LIMITED USE/LIMITED APPLICATION (LULA) ELEVATORS - CAR WITH DOORS ON ADJACENT SIDES - EXCEPTION
fr_ca: EMPLACEMENT DES PORTES POUR LES ASCENSEURS À USAGE LIMITÉ/APPLICATION LIMITÉE (LULA) - CABINE AVEC PORTES SUR LES CÔTÉS ADJACENTS - EXCEPTION

source: DOOR LOCATION FOR LIMITED USE/LIMITED APPLICATION (LULA) ELEVATORS - CAR WITH DOORS ON OPPOSITE SIDES
fr_ca: EMPLACEMENT DE LA PORTE POUR LES ASCENSEURS À USAGE LIMITÉ/APPLICATION LIMITÉE (LULA) - CABINE AVEC PORTES SUR LES CÔTÉS OPPOSÉS

source: DOOR LOCATION FOR LIMITED USE/LIMITED APPLICATION (LULA) ELEVATORS - CAR WITH SINGLE DOOR
fr_ca: EMPLACEMENT DE LA PORTE POUR LES ASCENSEURS À USAGE LIMITÉ/APPLICATION LIMITÉE (LULA) - CABINE À PORTE UNIQUE

source: DOORS AND ENCLOSURES REGULATEDBY SECTION R308.4.5a(Category Class)
fr_ca: PORTES ET ENCEINTES RÉGLEMENTÉES PAR LA SECTION R308.4.5 a (Classe de catégorie)

source: Dampers shall be installed in the fireplace or the chimney venting the fireplace, and shall be operable from the room containing the fireplace.
fr_ca: Les registres doivent être installés dans le foyer ou dans la cheminée qui ventile le foyer, et doivent pouvoir être actionnés à partir de la pièce où se trouve le foyer.

source: Decorative materials and trim shall be restricted by combustibility, fire performance or flame propagation performance criteria in accordance with Section 806.
fr_ca: Les matériaux décoratifs et les éléments de finition doivent être assujettis à des critères de combustibilité, de performance au feu ou de performance en matière de propagation des flammes, conformément à la section 806.

source: Deferral of any submittal items shall have the prior approval of the building official.
fr_ca: Le report de tout élément à soumettre doit être préalablement approuvé par le responsable de la construction.

source: Demarcation lines on walls shall transition vertically to the floor and then extend across the floor where a line on the floor is the only practical method of outlining the path.
fr_ca: Les lignes de démarcation sur les murs doivent passer verticalement au plancher, puis se prolonger sur le plancher lorsque l’utilisation d’une ligne sur le plancher constitue le seul moyen pratique de délimiter le parcours.

source: Demarcation lines shall not extend in front of exit discharge doors that lead out of an exit and through which occupants must travel to complete the exit path.
fr_ca: Les lignes de démarcation ne doivent pas se prolonger devant les portes d’issue au niveau de l’issue qui donnent vers l’extérieur d’une issue et que les occupants doivent franchir pour compléter le parcours de l’issue.

source: Describe the land on which the proposed work is to be done by legal description, street address or similar description that will readily identify and definitely locate the proposed building or work.
fr_ca: Décrire le terrain sur lequel les travaux proposés doivent être effectués au moyen d’une description légale, d’une adresse municipale ou d’une description similaire qui permettra d’identifier facilement et de localiser avec précision le bâtiment ou les travaux proposés.

source: Designated aisle seats shall comply with Section 802.8.
fr_ca: Les sièges désignés situés dans les allées doivent être conformes à la section 802.8.

source: Designations and indicators of car controls shall comply with Section 407.4.7.
fr_ca: Les désignations et les indicateurs des commandes de la cabine doivent être conformes à la section 407.4.7.

source: Destination oriented elevator systems shall not be required to comply with Section 407.2.4.
fr_ca: Les systèmes d'ascenseurs orientés vers la destination ne sont pas tenus de se conformer à la section 407.2.4.

source: Destination-oriented elevators shall be provided with a visible signal and audible tones, and verbal announcements to indicate which car is responding to a call.
fr_ca: Les ascenseurs à destination doivent être dotés d'un signal visible et de tonalités sonores, ainsi que d'annonces verbales pour indiquer quelle cabine répond à un appel.

source: Destination-oriented elevators shall not be required to comply with Section 407.2.1.4.
fr_ca: Les ascenseurs orientés vers la destination ne sont pas tenus de se conformer à la section 407.2.1.4.
